import 'package:azkar_app/features/AzkarDetails/model/Azkar_Model.dart';
import 'package:hive/hive.dart';

Future<void> preloadAzkar() async {
  var box = Hive.box<Zekr>('azkarBox');

  if (box.isEmpty) {
    // List<Zekr> allAzkar = [
    //   Zekr(text: 'الله اكبر', count: 3, type: AzkarType.morning),
    //   Zekr(text: 'لا اله الا الله', count: 3, type: AzkarType.morning),
    //   Zekr(text: 'محمد رسول الله ', count: 3, type: AzkarType.morning),
    //   Zekr(text: 'سبحان الله ', count: 3, type: AzkarType.morning),

    //   //night
    //   Zekr(text: 'مساء', count: 3, type: AzkarType.night),
    //   Zekr(text: 'مساء  ', count: 3, type: AzkarType.night),
    //   Zekr(text: ' مساء ', count: 3, type: AzkarType.night),
    //   Zekr(text: 'مساء ', count: 3, type: AzkarType.night),

    //   //praying
    //   Zekr(text: 'wghi', count: 3, type: AzkarType.praying),
    //   Zekr(text: 'wghi', count: 3, type: AzkarType.praying),
    //   Zekr(text: 'wghi', count: 3, type: AzkarType.praying),
    //   Zekr(text: 'wghi', count: 3, type: AzkarType.praying),
    // ];
    List<Zekr> allAzkar = [
      ...morningAzkar,
      ...nightAzkar,
      ...wakeUp,
      ...sleep,
      ...praying,
      ...saving,
      ...mosque,
      ...astazed,
      ...ahadeth,
    ];
    await box.addAll(allAzkar);
  }
}

List<Zekr> morningAzkar = [
  Zekr(
    text:
        '''بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ
        ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ، ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ، مَٰلِكِ يَوۡمِ ٱلدِّينِ،إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ، ٱهۡدِنَاٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ ،صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ''',
    count: 1,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''الم، ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِلْمُتَّقِينَ ،الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ، وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ، أُولَٰئِكَ عَلَىٰ هُدًى مِنْ رَبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ''',
    count: 1,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ''',
    count: 1,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
        قُلۡ هُوَ ٱللَّهُ أَحَدٌ ،ٱللَّهُ ٱلصَّمَدُ، لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ، وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
        قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ، مِن شَرِّ مَا خَلَقَ ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ،وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
        قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ ،إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ، ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ، مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''أصبحنا وأصبح الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له  الملك وله الحمد وهو على كل شيء قدير، رب أسألك خير ما في هذا اليوم  وخير ما بعده، وأعوذ بك من شر ما هذا اليوم وشر ما بعده رب أعوذ بك من الكسل وسوء الكبر ،رب اعوذ بك من عذاب في النار وعذاب في القبر''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text: '''اللهم بك أصبحنا وبك أمسينا ، وبك نحيا وبك نموت وإليك المصير''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''أصبحنا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما، وما كان من المشركين''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي وأبوء لك بذنبي، فاغفر لي؛ فإنه لا يغفر الذنوب إلا أنت''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''اللهم إني أعوذ بك من الكفر، والفقر، اللهم إني أعوذ بك من عذاب القبر، لا إله إلا أنت''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''اللهم فاطر السموات والأرض، عالم الغيب والشهادة، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسي، وشر الشيطان وشركه''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''اللهم صل على محمد وعلى آل محمد كما صليت على ابراهيم وعلى آل محمد وبارك على محمد وعلي آل محمد كما باركت علي ابراهيم وعلى آل ابراهيم في العالمين انك حميد مجيد''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text: '''حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم''',
    count: 7,
    type: AzkarType.morning,
  ),

  Zekr(
    text:
        '''اللهم إني أسألك العافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يدي ومن خلفي وعن يميني وعن شمالي، ومن فوقي، وأعوذ بعظمتك أن أغتال من تحتي''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء، وهو السميع العليم''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text: '''رضيت بالله ربا وبالإسلام دينا، وبمحمد صلى الله عليه وسلم نبيا''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله، ولا تكلني إلى نفسي طرفة عين أبدًا''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text:
        '''لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير''',
    count: 10,
    type: AzkarType.morning,
  ),
  Zekr(
    text: '''سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text: '''أعوذ بكلمات الله التامات من شر ما خلق''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(
    text: '''استغفر الله العظيم الذي لا إله إلا هو الحي القيوم و أتوب إليه''',
    count: 3,
    type: AzkarType.morning,
  ),
  Zekr(text: '''سبحان الله وبحمده ''', count: 100, type: AzkarType.morning),

];

List<Zekr> nightAzkar = [
  Zekr(
    text:
        '''بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ
        ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ، ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ، مَٰلِكِ يَوۡمِ ٱلدِّينِ،إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ، ٱهۡدِنَاٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ ،صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ''',
    count: 1,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''الم، ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِلْمُتَّقِينَ ،الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ، وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ، أُولَٰئِكَ عَلَىٰ هُدًى مِنْ رَبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ''',
    count: 1,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ''',
    count: 1,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''لِّلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَإِن تُبْدُوا مَا فِي أَنفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُم بِهِ اللَّهُ ۖ فَيَغْفِرُ لِمَن يَشَاءُ وَيُعَذِّبُ مَن يَشَاءُ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ، آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ، لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ''',
    count: 1,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
        قُلۡ هُوَ ٱللَّهُ أَحَدٌ ،ٱللَّهُ ٱلصَّمَدُ، لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ، وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
        قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ، مِن شَرِّ مَا خَلَقَ ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ،وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
        قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ ،إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ، ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ، مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''أمسينا وامسى الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له  الملك وله الحمد وهو على كل شيء قدير، رب أسألك خير ما في هذة الليلة وخير ما بعده، وأعوذ بك من شر ما هذة الليلة وشر ما بعده رب أعوذ بك من الكسل وسوء الكبر ،رب اعوذ بك من عذاب في النار وعذاب في القبر''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text: '''اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت وإليك النشور''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''أمسينا  على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما، وما كان من المشركين''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي وأبوء لك بذنبي، فاغفر لي؛ فإنه لا يغفر الذنوب إلا أنت''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''اللهم إني أعوذ بك من الكفر، والفقر، اللهم إني أعوذ بك من عذاب القبر، لا إله إلا أنت''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''اللهم فاطر السموات والأرض، عالم الغيب والشهادة، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسي، وشر الشيطان وشركه''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''اللهم صل على محمد وعلى آل محمد كما صليت على ابراهيم وعلى آل محمد وبارك على محمد وعلي آل محمد كما باركت علي ابراهيم وعلى آل ابراهيم في العالمين انك حميد مجيد''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text: '''حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم''',
    count: 7,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''اللهم إني أسألك العافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يدي ومن خلفي وعن يميني وعن شمالي، ومن فوقي، وأعوذ بعظمتك أن أغتال من تحتي''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء، وهو السميع العليم''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text: '''رضيت بالله ربا وبالإسلام دينا، وبمحمد صلى الله عليه وسلم نبيا''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله، ولا تكلني إلى نفسي طرفة عين أبدًا''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text:
        '''لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير''',
    count: 10,
    type: AzkarType.night,
  ),
  Zekr(
    text: '''سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text: '''أعوذ بكلمات الله التامات من شر ما خلق''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(
    text: '''استغفر الله العظيم الذي لا إله إلا هو الحي القيوم و أتوب إليه''',
    count: 3,
    type: AzkarType.night,
  ),
  Zekr(text: '''سبحان الله وبحمده ''', count: 100, type: AzkarType.night),
];

List<Zekr> wakeUp = [
  Zekr(
    text: '''الحمدلله الذي رد على روحى وعافاني في جسدى وأذن لي بذكره''',
    count: 1,
    type: AzkarType.wakeUp,
  ),
  Zekr(text: '''لا إله الا أنت سبحانك''', count: 1, type: AzkarType.wakeUp),
  Zekr(
    text: '''اللهم استغفرك لذنبي واسالك رحمتك''',
    count: 1,
    type: AzkarType.wakeUp,
  ),
  Zekr(
    text:
        '''اللهم زدني علما ولا تزغ قلبي بعد اذ هديتني وهب لي من لدنك رحمة انك انت الوهاب''',
    count: 1,
    type: AzkarType.wakeUp,
  ),
  Zekr(
    text:
        '''لا إله إلا الله وحده لا شريك له، له الملك وله الحمد ،وهو على كل شيء قدير''',
    count: 1,
    type: AzkarType.wakeUp,
  ),
  Zekr(
    text:
        '''سبحان الله، والحمدلله ،ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله العلي العظيم ربي اغفر لي''',
    count: 1,
    type: AzkarType.wakeUp,
  ),
];
List<Zekr> sleep = [
  Zekr(
    text:
        '''بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ
        ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ، ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ، مَٰلِكِ يَوۡمِ ٱلدِّينِ،إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ، ٱهۡدِنَاٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ ،صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ،''',
    count: 1,
    type: AzkarType.sleep,
  ),
  Zekr(
    text:
        '''اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ''',
    count: 1,
    type: AzkarType.sleep,
  ),
  Zekr(
    text:
        '''لِّلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَإِن تُبْدُوا مَا فِي أَنفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُم بِهِ اللَّهُ ۖ فَيَغْفِرُ لِمَن يَشَاءُ وَيُعَذِّبُ مَن يَشَاءُ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ، آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ، لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ''',
    count: 1,
    type: AzkarType.sleep,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
        قُلۡ يَٰٓأَيُّهَا ٱلۡكَٰفِرُونَ، لَآ أَعۡبُدُ مَا تَعۡبُدُونَ ، وَلَآ أَنتُمۡ عَٰبِدُونَ مَآ أَعۡبُدُ ، وَلَآ أَنَا۠ عَابِدٞ مَّا عَبَدتُّمۡ ، وَلَآ أَنتُمۡ عَٰبِدُونَ مَآ أَعۡبُدُ ، لَكُمۡ دِينُكُمۡ وَلِيَ دِينِ''',
    count: 1,
    type: AzkarType.sleep,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
        قُلۡ هُوَ ٱللَّهُ أَحَدٌ ،ٱللَّهُ ٱلصَّمَدُ، لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ، وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ''',
    count: 3,
    type: AzkarType.sleep,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
        قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ، مِن شَرِّ مَا خَلَقَ ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ،وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ''',
    count: 3,
    type: AzkarType.sleep,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
        قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ ،إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ، ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ، مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ''',
    count: 3,
    type: AzkarType.sleep,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ إني  أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَوَجَّهْتُ وجهي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ،  وَأَلْجَأْتُ ظَهري إِلَيْكَ، رَغْبَةً إليك وَرَهْبَةً إِلَيْكَ، لا مَلْجَأَ ولا منجى مِنْكَ إِلَّا إِلَيْكَ آمَنْتُ بكتابك الذي أَنْزَلْتَ وَبِنَبِيِّكَ الَّذِي أَرْسَلْت''',
    count: 1,
    type: AzkarType.sleep,
  ),
];
List<Zekr> praying = [
  Zekr(
    text:
        '''اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ''',
    count: 1,
    type: AzkarType.praying,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
        قُلۡ هُوَ ٱللَّهُ أَحَدٌ ،ٱللَّهُ ٱلصَّمَدُ، لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ، وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ''',
    count: 3,
    type: AzkarType.praying,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
        قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ، مِن شَرِّ مَا خَلَقَ ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ،وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ''',
    count: 3,
    type: AzkarType.praying,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
        قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ ،إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ، ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ، مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ''',
    count: 3,
    type: AzkarType.praying,
  ),
  Zekr(
    text: '''استغفر الله العظيم واتوب اليه''',
    count: 3,
    type: AzkarType.praying,
  ),
  Zekr(text: '''سبحان الله''', count: 33, type: AzkarType.praying),
  Zekr(text: '''الحمدلله''', count: 33, type: AzkarType.praying),
  Zekr(text: '''الله اكبر''', count: 33, type: AzkarType.praying),
  Zekr(
    text:
        '''لا إله إلا الله وحده لا شريك له، له الملك وله الحمد يحي ويميت وهو على كل شيء قدير''',
    count: 1,
    type: AzkarType.praying,
  ),
  Zekr(
    text: '''اللهم أنت السلام ومنك السلام تباركت ياذا الجلال والإكرام''',
    count: 1,
    type: AzkarType.praying,
  ),
  Zekr(
    text:
        '''لا إله إلا الله وحده لا شريك له،  له الملك وله الحمد وهو على كل شيء قدير، اللهم لا مانع لما أعطيت، ولا معطي لما منعت ولا ينفع ذا الجد منك الجدُّ''',
    count: 1,
    type: AzkarType.praying,
  ),
  Zekr(
    text:
        '''لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير لا حول ولا قوة إلا بالله، لا إله إلا الله ولا نعبد إلا إياه، له النعمة وله الفضل وله الثناء الحسن، لا إله إلا الله مخلصين له الدين ولو كره الكافرون''',
    count: 1,
    type: AzkarType.praying,
  ),
  Zekr(
    text: '''اللهم إني أسألك علماً نافعاً ، ورزقاً طيباً وعملاً متقبلا''',
    count: 3,
    type: AzkarType.praying,
  ),
  Zekr(
    text:
        '''ربنا آتنا في الدنيا حسنة، وفي الآخرة حسنة، وقنا عذاب النار، وعذاب القبر، وفتنة المحيا والممات، وفتنة المسيح الدجال''',
    count: 3,
    type: AzkarType.praying,
  ),
];

List<Zekr> saving = [
  Zekr(
    text:
        '''بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ
        ، ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ، ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ، مَٰلِكِ يَوۡمِ ٱلدِّينِ،إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ، ٱهۡدِنَاٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ ،صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text:
        '''اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
         قُلۡ هُوَ ٱللَّهُ أَحَدٌ ،ٱللَّهُ ٱلصَّمَدُ، لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ، وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
         قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ، مِن شَرِّ مَا خَلَقَ ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ،وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text:
        '''بسم الله الرحمن الرحيم
         قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ ،إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ، ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ، مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text:
        '''بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text: '''أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شر مَا خَلَقَ''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text:
        '''أَعُوذُ بكلِمَاتِ اللهِ التَّامَّاتِ مِن غَضَبِهِ وَعِقَابِهِ وَشَرِّ عِبَادِهِ وَمِنْ هَمَزَانِ الشَّيَاطِينِ وَأَنْ يَحْضُرُون''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text:
        '''أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ الَّتِي لَا يُجَاوِزُهُنَّ بَرٌ وَلَا فَاجِرٌ مِنْ شَرِّ مَا خَلَقَ، وَبَرَأَ وَذَرَأَ ، وَمِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وَمِنْ شَرِّ مَا يَعْرُجُ فِيهَا ، وَمِنْ شَرِّ مَا ذَرَاً فِي الْأَرْضِ ، وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ، وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَرَبَّ الْعَرْشِ الْعَظِيمِ ، رَبَّنَا وَرَبَّ كُلَّ شَيْءٍ ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْقُرْآنِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ ، أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شيء''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text:
        ''':اذا اعجبك شئ قل
         بسم الله  مَا شَاءَ اللهُ لَا قُوَّةَ إِلَّا بِاللهِ اللَّهُمَّ بَارِكْ عَلَيْهِ''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text:
        '''تحصنتُ بالله الذي لا إله إلا هو إلهي واله كل شئ واعتصمت بربي ورب كل شئ وتوكلت على الحي الذي لا يموت واستدفعتُ الشر بـ لا حول ولا قوة إلا بالله حسبي الله ونعم الوكيل حسبي الرب من العباد حسبي الخالق من المخلوق حسبي الرازق من المرزوق حسبي الله هو حسبي حسبى الذي بيده ملكوت كل شئ وو يُجيرُ ولا يُجار عليه حسبي الله وكفى تسمع الله لمن دعا ليس وراء الله مرمى حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text: '''استودعتُك اللهم نفسي واهلي وبيتي وعرضي وخواتيم عملي  وكل ما أحب فإنك ياربي لا تضيع الودائع''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text: '''يا حي يا قيوم برحمتك استغيث أغثني''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text:
        '''اللهم أنت عضدي ،وانت نصيري ،بك أجول وبك أصول وبك أقاتل ،حسبنا الله ونعم الوكيل''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text: '''اللهم إنا نجعلك في نحورهم ونعوذ بك من شرورهم''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text:
        '''إنا لله وإنا إليه راجعون اللهم أجرني في  مصيبتي واخلف لي خيرا منها ولا حول ولا قوة إلا بالله العلي العظيم''',
    count: 1,
    type: AzkarType.saving,
  ),
  Zekr(
    text: '''حسبي الله الذي لا إله إلا هو عليه توكلت وهو رب العرش العظيم''',
    count: 1,
    type: AzkarType.saving,
  ),
];
List<Zekr> mosque = [
  Zekr(
    text:
        ''': دعاء الذهاب إلى المسجد
        اللهم اجعل في قلبي نوراً ، وفي لساني نورا، واجعل في سمعي نوراً ، واجعل في بصري نورا واجعل من خلفي نوراً ، ومن أمامي نوراً ، واجعل من فوقي نورا ومن تحتي نوراً . اللهم أعطني نورا''',
    count: 1,
    type: AzkarType.mosque,
  ),
  Zekr(
    text:
        ''': دعاء دخول المسجد
         أعوذ بالله العظيم وبوجهه الكريم وسلطانه القديم من الشيطان الرجيم بسم الله ، والصلاة  والسلام على رسول الله اللهم افتح لي أبواب رحمتك''',
    count: 1,
    type: AzkarType.mosque,
  ),
  Zekr(
    text:
        ''': دعاء الخروج من المسجد
         بسم الله والصلاة والسلام على رسول الله، اللهم إني أسألك من فضلك، اللهم اعصمني من الشيطان الرجيم''',
    count: 1,
    type: AzkarType.mosque,
  ),
];
List<Zekr> astazed = [
  Zekr(
    text:
        '''لا إله إلا الله وحده لا شريك له الملك وله الحمد وهو على كل شيء قدير''',
    count: 100,
    type: AzkarType.mostazed,
  ),
  Zekr(
    text: '''لا حول ولا قوة إلا بالله العلي العظيم''',
    count: 100,
    type: AzkarType.mostazed,
  ),
  Zekr(
    text:
        '''اللهم صل وسلم وبارك على نبينا محمد وعلى آهلهِ وصحبه وسلم تسليما كثيرا''',
    count: 100,
    type: AzkarType.mostazed,
  ),
  Zekr(
    text: '''لا إله إلا أنت سبحانك إني كنت من الظالمين''',
    count: 100,
    type: AzkarType.mostazed,
  ),
  Zekr(
    text:
        '''سبحان الله والحمدلله ولا إله إلا الله والله اكبر ربي اغفر لي وارحمني''',
    count: 100,
    type: AzkarType.mostazed,
  ),
  Zekr(
    text: '''استغفر الله الذي لا إله إلا هو الحي القيوم و أتوب إليه''',
    count: 100,
    type: AzkarType.mostazed,
  ),
];
List<Zekr> ahadeth = [
  Zekr(
    text:
        '''اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى، وَالتَّقَى ، وَالْعَفَافَ ، وَالْغِنَى''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ؛ اغْفِرْ لِي ، وَارْحَمْنِي ، وَاهْدِنِي ، وَعَافِنِي ، وَارْزُقْنِي''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text: '''اللهَم اني اسألك الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text: '''يَا مُقَلِّبَ الْقُلُوبِ : ثَبِّتْ قَلْبِي عَلَى دِينِكَ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ؛ إِنِّي أَسْأَلُكَ حُبَّكَ ، وَحُبَّ مَنْ يُحِبُّكَ ، وَالْعَمَلَ الَّذِي يُبَلِّغُنِي حُبَّكَ ، اللَّهُمَّ ؛ أَجْعَلْ حُبَّكَ أَحَبَّ إِلَيَّ مِنْ نَفْسِي وَأَهْلِي ، وَمِنَ الْمَاءِ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ؛ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، وَأَنْتَ الْمُسْتَعَانُ ، وَعَلَيْكَ الْبَلَاغُ ؛ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ إِنِّي أَسْأَلَكَ مُوجِبَاتِ رَحْمَتِكَ ، وَعَزَائِمَ مَغْفِرَتِكَ، وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ ، وَالْغَنِيمَةَ مِنْ كُلِّ بِرٍ ، وَالْفَوْزَ بِالْجَنَّةِ ، وَالنَّجَاةَ مِنَ النَّارِ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ؛ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ ، وَعَذَابِ النَّارِ ، وَمِنْ شَرْ الْغِنَى وَالْفَقْرِ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ : إِنِّي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الْأَخْلَاقِ وَالْأَعْمَالِ  والأهواءِ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ؛ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ سَمْعِي ، وَمِنْ شَرِّ بَصَرِي ، وَمِنْ شَرٌ لِسَانِي ، وَمِنْ شَرِّ قَلْبِي ، وَمِنْ شَرِّ مَنِي''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ؛ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ ، وَالْجُنُونِ ، وَالْجُذَامِ ، وَسَيْءِ الْأَسْقَامِ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ؛ إِنِّي أَعُوذُ بِكَ مِنَ الْجُوعِ ؛ فَإِنَّهُ بِئْسَ الضَّجِيعُ ، وَأَعُوذُ بِكَ مِنَ الْخِيَانَةِ ؛ فَإِنَّهَا بِئْسَتِ الْبِطَانَةُ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ : أَكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ ،وَأَغْنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ؛ أَلْهِمْنِي رُشْدِي ، وَأَعِذْنِي مِنْ شَرِّ نَفْسِي''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ . ، مُصَرِّفَ الْقُلُوبِ ؛ صَرِّفَ قُلُوبَنَا عَلَى طَاعَتِكَ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''أعوذ بِاللَّهِ مِنْ جَهْدِ الْبَلاءِ ، وَدَركِ الشَّقَاءِ ، وَسُوءِ الْقَضَاءِ ، وَشَمَاتَةِ الْأَعْدَاءِ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ؛ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي ، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي ، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي ، وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ ، وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرِّ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text: '''اللَّهُمَّ ؛ اهْدِنِي وَسَدِّدْنِي''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ، إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ ، وَالْجُبْنِ وَالْهَرَمِ وَالْبُخْلِ ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ؛ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً ، وَلَا يَغْفِرُ الذُّنُوبَ إِلا أَنْتَ .. فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي ؛ إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي ، وَإِسْرَافِي فِي أَمْرِي ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي ، اللَّهُمَّ ؛ أَغْفِرْ لِي جِدِّي وَهَزْلِي ، وَخَطَئِي وَعَمْدِي ، وَكُلُّ ذَلِكَ عِنْدِي ، اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي ، أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ ، وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ؛ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، وَأَنْتَ الْمُسْتَعَانُ ، وَعَلَيْكَ الْبَلَاغُ ؛ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ إِنِّي أَسْأَلَكَ مُوجِبَاتِ رَحْمَتِكَ ، وَعَزَائِمَ مَغْفِرَتِكَ ، وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ ، وَالْغَنِيمَةَ مِنْ كُلِّ بِرٍ ، وَالْفَوْزَ بِالْجَنَّةِ ، وَالنَّجَاةَ مِنَ النَّارِ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ، إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ ، وَمِنْ شَرِّ ما لم أعمل''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ؛ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ ، وَتَحَوُّلِ عَافِيَتِكَ ، وَفُجَاءَةِ نِقْمَتِكَ ، وَجَمِيعِ سَخَطِكَ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ ، إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ ، وَالْبُخْلِ وَالْهَرَمِ ، وَعَذَابِ الْقَبْرِ ، اللَّهُمَّ ؛ آتِ نَفْسِي تَقْوَاهَا ، وَزَكْهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا ، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا ، اللَّهُمَّ ؛ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ ، وَمِنْ قَلْبِ لَا يَخْشَعُ ، وَمِنْ نَفْسٍ لَا تَشْبَعُ ، وَمِنْ دَعْوَةٍ لا يُسْتَجَابُ لَهَا''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللَّهُمَّ  لَكَ أَسْلَمْتُ ، وَبِكَ آمَنتُ ، وَعَلَيْكَ تَوَكَّلْتُ ، وَإِلَيْكَ أَنبتُ وبِكَ خَاصَمْتُ ، وَإِلَيْكَ حَاكَمْتُ .. فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَرْتُ ، وَمَا أَسْرَرْتُ''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text: '''اللَّهمَّ مُنزِلَ الكتابِ سريعَ الحسابِ اهزِمْهم وزلزِلْهم''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللهم من عدا أهل غزة والمسلمين فعادِه ومن كادهم فَكِده ومن بَغى عليهم بمَهلكةٍ فأهلكهُ ومن نصب لهم فخا فخُذه وأطفئ عنهم نارَ من شب ناره عليهم واكفهم ما أهمهم من أمر الدنيا والاخرةهذا الدعاء ليس عن النبي صل الله عليه وسلم''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
  Zekr(
    text:
        '''اللهم انصر إخواننا المستضعفين في غزة وفلسطين والسودان والشيشان وفي كل مكان اللهم نصرك الذي وعدت فوعدك الحق وانت الحق ولا حول ولا قوة إلا بالله العلي العظيم،هذا الدعاء ليس عن النبي صل الله عليه وسلم''',
    count: 1,
    type: AzkarType.ahadeth,
  ),
];
const List<String> islamicGreetings = [
  "بارك الله فيك",
  "أكرمك الله من حيث لا تحتسب",
  "رزقك الله سعادة لا تزول",
  "جعلك الله من السعداء في الدنيا والآخرة",
  "رفع الله قدرك",
  "أسعدك الله وشرح صدرك",
  "جعلك الله ممن طال عمره وحسن عمله",
  "زادك الله من فضله",
  "جعلك الله ممن يستمعون القول فيتبعون أحسنه",
  "رزقك الله خير الدنيا والآخرة",
  "سدد الله خطاك",
  "فتح الله لك أبواب الخير",
  "كتب الله لك أجر الصابرين",
  "جعلك الله من الذاكرين الشاكرين",
  "جعلك الله مباركاً أينما كنت",
  "تقبل الله منا ومنكم صالح الأعمال",
  "عسى الله أن يحقق أمنياتك",
  "رزقك الله لذة الطاعة",
  "بلغك الله رمضان وأنت في صحة وعافية",
  "جمعنا الله بك في جنات النعيم",
  "غفر الله لك ولوالديك",
  "نور الله قلبك بالإيمان",
  "جعلك الله من عباد الرحمن",
  "أدام الله عليك نعمته",
  "جعلك الله من المقبولين",
  "وفقك الله لما يحب ويرضى",
  "نفع الله بك",
  "كتب الله لك الخير كله",
  "جعل الله كل خطوة تخطوها لك في ميزان حسناتك",
  "لا حرمك الله الأجر",
  "جعلك الله من أهل القرآن",
  "رزقك الله بركة في الوقت والعمل",
  "جعلك الله من أصحاب القلوب النقية",
  "رزقك الله حُسن الخاتمة",
  "أبدلك الله خيراً مما فقدت",
  "شرح الله صدرك ويسر أمرك",
  "ألبسك الله لباس العافية",
  "جعلك الله قرة عين لوالديك",
  "ملأ الله قلبك نوراً وسكينة",
  "جعلك الله هادياً مهدياً",
  "أحاطك الله بلطفه",
  "جعلك الله من الفائزين في الدنيا والآخرة",
  "رزقك الله علماً نافعاً",
  "جعلك الله سبباً في هداية غيرك",
  "جعلك الله نوراً لمن حولك",
  "رزقك الله محبة الناس",
  "جعلك الله كالغيث أينما حل نفع",
  "أنار الله دربك",
  "وفقك الله في مسعاك",
  "جعلك الله من الشاكرين الصابرين",
  "أكرمك الله بما تتمنى",
  "جعل الله أيامك عامرة بالطاعات",
  "رزقك الله القبول في الأرض والسماء",
  "ثبتك الله على طاعته",
  "أضاء الله دربك بالإيمان",
  "جعلك الله من الذين لا خوف عليهم ولا هم يحزنون",
  "رزقك الله حُسن الظن به",
  "أدام الله عليك راحة البال",
  "جعلك الله من عباده المخلصين",
  "أعزك الله بطاعته",
  "غمر الله قلبك طمأنينة",
  "رزقك الله الرضا بما قسم",
  "جعلك الله حبيباً له ولعباده",
  "حفظك الله من كل سوء",
  "جعلك الله من أحبائه وأوليائه",
  "سقاك الله من كوثر نبيه",
  "جعلك الله ممن طال عمره وحسن عمله",
  "زادك الله قرباً منه",
  "أسعدك الله في الدارين",
  "رزقك الله خشوع القلب",
  "جعلك الله من المفلحين",
  "وفقك الله للخير حيث كان",
  "جعل الله النجاح حليفك",
  "رفع الله ذكرك في العالمين",
  "رزقك الله التوفيق في كل أمورك",
  "جعلك الله من المتوكلين عليه",
  "ألبسك الله لباس التقوى",
  "جعلك الله ممن ينالون رضاه",
  "وهبك الله سعادة لا تنتهي",
  "رزقك الله البركة في رزقك",
  "جعلك الله من الذين يسعى نورهم بين أيديهم",
  "أضاء الله قلبك بالتقوى",
  "جعلك الله من الصالحين المصلحين",
  "أعانك الله على طاعته",
  "رزقك الله حُسن العمل وقبوله",
  "جعلك الله من عباد الليل والنهار",
  "وفقك الله لخير القرارات",
  "أعزك الله بطاعته ورضاه",
  "جعلك الله من أهل السكينة والوقار",
  "رزقك الله لذة مناجاته",
  "جعلك الله من أهل الفردوس الأعلى",
  "جعلك الله من عباد السجود والدعاء",
  "بارك الله لك في صحتك وأهلك",
  "جعلك الله من أهل التقى",
  "رزقك الله حج بيته الحرام",
  "جعلك الله من المتحابين فيه",
  "وفقك الله لصلاح القلب والقول",
  "جعلك الله من أهل الخير دائماً",
  "رفع الله درجتك في عليين",
  "جعلك الله من الفائزين بنعيمه الأبدي"
];
